// ================================================================
// ЭКЗАМЕНЫ
// ================================================================
const examsData = [
    { subject: 'Математика', status: 'Диф. зачёт', date: '-', note: '' },
    { subject: 'Физика', status: 'Экзамен', date: '-', note: '' },
    { subject: 'Информатика', status: 'Экзамен', date: '-', note: '' },
    { subject: 'Химия', status: 'Экзамен', date: '-', note: '' },
    { subject: 'Инженерная графика', status: 'Экзамен', date: '-', note: '' },
    { subject: 'Технология конструкционных материалов', status: 'Зачёт', date: '-', note: '' },
    { subject: 'Английский язык', status: 'Зачёт', date: '-', note: 'Первый сем зачёт, чтобы получить достаточно посещать пары и стараться. второй семестр диф. зачёт: перевод текста, пересказ, рассказать билет' },
    { subject: 'Введение в инженерное образование', status: 'Экзамен', date: '-', note: '' },
    { subject: 'Физкультура', status: 'Зачёт', date: '-', note: '' },
];
