// ================================================================
// СПИСОК ГРУППЫ
// ================================================================
const groupMembers = [
    { name: 'Бамбизов Эрик Сергеевич', subgroup: '1-я', note: '19.12.2008' },
    { name: 'Бовтот Михаил Викторович', subgroup: '2-я', note: '31.03.2009' },
    { name: 'Васильченко Виталий Сергеевич', subgroup: '1-я', note: '09.03.2009' },
    { name: 'Войтеховский Савелий Валерьевич', subgroup: '2-я', note: '16.11.2008' },
    { name: 'Гонтаренко Алексей Андреевич', subgroup: '1-я', note: '07.10.2008' },
    { name: 'Здунюк Степан Вадимович', subgroup: '1-я', note: '02.04.2009' },
    { name: 'Кравцова Юлия Дмитриевна', subgroup: '2-я', note: '17.09.2008' },
    { name: 'Куликов Роман Анатольевич', subgroup: '1-я', note: '' },
    { name: 'Кулинчик Матвей Алексеевич', subgroup: '1-я', note: '01.10.2008' },
    { name: 'Лавинецкий Никита Дмитриевич', subgroup: '1-я', note: '18.10.2008' },
    { name: 'Ластовский Вадим Юрьевич', subgroup: '2-я', note: '' },
    { name: 'Маковский Вадим Александрович', subgroup: '2-я', note: '26.02.2009' },
    { name: 'Мелешко Глеб Викторович', subgroup: '1-я', note: '30.06.2006' },
    { name: 'Парахадов Малик', subgroup: '-', note: '' },
    { name: 'Росликов Константин Михайлович', subgroup: '1-я', note: '02.09.2009' },
    { name: 'Савчик Илья Дмитриевич', subgroup: '2-я', note: '26.09.2008' },
    { name: 'Селюжицкий Андрей Дмитриевич', subgroup: '2-я', note: '26.08.2008' },
    { name: 'Тарабаш Никита Дмитриевич', subgroup: '2-я', note: '' },
    { name: 'Точило Артём Сергеевич', subgroup: '2-я', note: '18.11.2008' },
    { name: 'Хомич Роман Сергеевич', subgroup: '2-я', note: '29.08.2009' },
    { name: 'Шагун Рустам Сергеевич', subgroup: '1-я', note: '' },
];
