// ================================================================
// УЧЕБНЫЕ МАТЕРИАЛЫ
// ================================================================
const materialsData = [
    {
        subject: 'Математика',
        items: [
            { name: '', type: '' },
        ]
    },
    {
        subject: 'Физика',
        items: [
            { name: 'График выполнения лаб', type: 'Вспомогательные', link: 'Fiz_grafik_lab.pdf' },
            { name: 'Экзаменационные вопросы', type: 'Вспомогательное', link: 'Fiz_examenacionye_voprosy.pdf' },
            { name: 'Яндекс диск с лаб. работами', type: 'Вспомогательные', link: 'https://disk.yandex.by/d/ANeGLA2T3SQSTs' },
            { name: 'Изучение погрешностей измерений', type: 'Методичка', link: 'Fiz_izuchenie_pogreshnostej.pdf' },
            { name: 'Трофимова Т.И. "Курс физики"', type: 'Учебник' },
            {
                name: 'Савельев И.В. "Курс общей физики"',
                type: 'Учебник',
                volumes: [
                    { label: 'Том 1. Механика. Молекулярная физика' },
                    { label: 'Том 2. Электричество и магнетизм. Волны. Оптика' }
                ]
            },
            {
                name: 'Сивухин Д.В. "Курс физики"',
                type: 'Учебник',
                volumes: [
                    { label: 'Том 1. Механика' },
                    { label: 'Том 2. Термодинамика и молекулярная физика' }
                ]
            },
            { name: 'Фейнмановские лекции по физике', type: 'Учебник' },
        ]
    },
    {
        subject: 'Химия',
        items: [
            { name: 'Номера ИДЗ', type: 'Вспомогательные', link: 'Xim_nomera_idz.pdf' },
            { name: 'Задания ИДЗ. Гл1-4', type: 'Вспомогательные', link: 'Xim_zadanya_idz.pdf' },
            { name: 'Гл1. Основные классы неорганических соединений', type: 'Презентация', link: 'Xim_1_osn_klas_neorg_soedinenyi.ppt' },
        ]
    },
    {
        subject: 'Инженерная графика',
        items: [
            { name: '', type: '' },
        ]
    },
    {
        subject: 'Технология конструкционных материалов',
        items: [
            { name: 'Комаров О.С. "Технология конструкционных материалов"', type: 'Учебник' },
            { name: 'Дальский А.М. "Технология конструкционных материалов"', type: 'Учебник' },
            { name: 'Кузьмин Б.А. "Технология металлов и конструкционных материалов"', type: 'Учебник' },
            { name: 'Солнцев В.П. "Металловедение и технология металлов"', type: 'Учебник' },
        ]
    },
    {
        subject: 'Английский язык',
        items: [
            { name: 'Механика. Английский для студентов-машиностроителей', type: 'Учебник', link: 'Mekhanika_Anglijskij_dlya_studentov-mashinostroitelej.pdf' },
        ]
    }
];
