// ================================================================
// РАСПИСАНИЕ
// ================================================================
const schedule = {
    1: {
        'Понедельник': [
            { time: '13:55 – 15:30', name: 'Информатика', type: 'Лабораторная', teacher: 'Кавальчук О.Н.', room: 'а.406 к.6', subgroup: '1-я подгруппа' },
            { time: '15:40 – 17:15', name: 'Физкультура', type: ' ', teacher: 'Кришталь С.А., Панова Е.В.', room: 'к.11Б' },
            { time: '17:45 – 19:20', name: 'Инженерная графика', type: 'Лекция', teacher: 'Джежора С.В.', room: 'а.4п к.8' },
            { time: '19:30 – 21:05', name: 'Технология конструкционных материалов', type: 'Лабораторная', teacher: 'Чигринов В.Е., Пузынин Я.С.', room: 'лаб.12 к.7', subgroup: '2-я подгруппа' },
        ],
        'Вторник': [
            { time: '12:00 – 13:35', name: 'ОИЗ. Инженерная графика', type: 'Практика', teacher: 'Джежора С.В.', room: 'а.510 к.8' },
            { time: '13:55 – 15:30', name: 'Английский язык', type: 'Практика', teacher: 'Лапко О.А.', room: 'а.430 к.18' },
            { time: '15:40 – 17:15', name: 'Математика', type: 'Лекция', teacher: 'Крушевский Е.А.', room: 'а.2п к.17' },
            { time: '17:45 – 19:20', name: 'Физика', type: 'Лекция', teacher: 'Бобученко Д.С.', room: 'а.2п к.17' },
        ],
        'Среда': [
            { time: '09:55 – 11:30', name: 'Химия', type: 'Лаб + Пр', teacher: 'Стрелкова Е.В.', room: 'лаб.512 к.11', subgroup: '1-я подгруппа' },
            { time: '12:00 – 13:35', name: 'Профессиональное обучение по профессиям рабочих', type: 'Лабораторная', teacher: '?', room: 'Мастерская к.7' },
            { time: '15:40 – 17:15', name: 'Химия', type: 'Лекция', teacher: 'Стрелкова Е.В.', room: 'а.2п к.17' },
            { time: '17:45 – 19:20', name: 'Информатика', type: 'Лекция', teacher: 'Кавальчук О.Н.', room: 'а.2п к.17' },
        ],
        'Четверг': [
            { time: '12:00 – 13:35', name: 'Профессиональное обучение по профессиям рабочих', type: 'Лабораторная', teacher: '?', room: 'Мастерская к.7' },
            { time: '13:55 – 15:30', name: 'Профессиональное обучение по профессиям рабочих', type: 'Лабораторная', teacher: '?', room: 'Мастерская к.7' },
            { time: '15:40 – 17:15', name: 'Физкультура', type: ' ', teacher: 'Кришталь С.А., Панова Е.В.', room: 'к.11Б' },
            { time: '17:45 – 19:20', name: 'Инженерная графика', type: 'Практика', teacher: 'Джежора С.В.', room: 'а.518 к.8' },
            { time: '19:30 – 21:05', name: 'ОИЗ.Физика', type: 'Практика', teacher: 'Бобученко Д.С.', room: 'а.203 к.17' },
        ],
        'Пятница': [
            { time: '13:55 – 15:30', name: 'Физика', type: 'Практика', teacher: 'Бобученко Д.С.', room: 'а.201 к.17' },
            { time: '15:40 – 17:15', name: 'Математика', type: 'Практика', teacher: 'Доронина А.В.', room: 'а.221 к.6' },
            { time: '17:45 – 19:20', name: 'Информатика', type: 'Лабораторная', teacher: 'Кавальчук О.Н.', room: 'а.406 к.6', subgroup: '1-я подгруппа' },
            { time: '17:45 – 19:20', name: 'Технология конструкционных материалов', type: 'Лабораторная', teacher: 'Чигринов В.Е., Пузынин Я.С.', room: 'лаб.12 к.7', subgroup: '2-я подгруппа' },
            { time: '19:30 – 21:05', name: 'Информатика', type: 'Лабораторная', teacher: 'Кавальчук О.Н.', room: 'а.406 к.6', subgroup: '2-я подгруппа' },
        ],
        'Суббота': [
            { time: '12:00 – 13:35', name: 'Технология конструкционных материалов', type: 'Лекция', teacher: 'Мамонов А.М.', room: 'а.4п к.8' },
            { time: '13:55 – 15:30', name: 'Английский язык', type: 'Практика', teacher: 'Лапко О.А.', room: 'а.430 к.18' },
            { time: '15:40 – 17:15', name: 'Введение в инженерное образование', type: 'Практика', teacher: 'Махахей А.Н.', room: 'а.307 к.6' },
        ]
    },
    2: {
        'Понедельник': [
            { time: '13:55 – 15:30', name: 'Информатика', type: 'Лабораторная', teacher: 'Кавальчук О.Н.', room: 'а.406 к.6', subgroup: '2-я подгруппа' },
            { time: '15:40 – 17:15', name: 'Физкультура', type: ' ', teacher: 'Кришталь С.А., Панова Е.В.', room: 'к.11Б' },
            { time: '17:45 – 19:20', name: 'Инженерная графика', type: 'Лекция', teacher: 'Джежора С.В.', room: 'а.4п к.8' },
            { time: '19:30 – 21:05', name: 'Технология конструкционных материалов', type: 'Лабораторная', teacher: 'Чигринов В.Е., Пузынин Я.С.', room: 'лаб.12 к.7', subgroup: '1-я подгруппа' },
        ],
        'Вторник': [
            { time: '12:00 – 13:35', name: 'Профессиональное обучение по профессиям рабочих', type: 'Лабораторная', teacher: '?', room: 'Мастерская к.7' },
            { time: '13:55 – 15:30', name: 'Английский язык', type: 'Практика', teacher: 'Лапко О.А.', room: 'а.430 к.18' },
            { time: '15:40 – 17:15', name: 'Математика', type: 'Лекция', teacher: 'Крушевский Е.А.', room: 'а.2п к.17' },
            { time: '17:45 – 19:20', name: 'Физика', type: 'Лекция', teacher: 'Бобученко Д.С.', room: 'а.2п к.17' },
        ],
        'Среда': [
            { time: '09:55 – 11:30', name: 'Химия', type: 'Лаб + Пр', teacher: 'Стрелкова Е.В.', room: 'лаб.512 к.11', subgroup: '2-я подгруппа' },
            { time: '13:55 – 15:30', name: 'Инженерная графика', type: 'Практика', teacher: 'Джежора С.В.', room: 'а.520 к.8' },
            { time: '15:40 – 17:15', name: 'Химия', type: 'Лекция', teacher: 'Стрелкова Е.В.', room: 'а.2п к.17' },
            { time: '17:45 – 19:20', name: 'Физика', type: 'Лекция', teacher: 'Бобученко Д.С.', room: 'а.2п к.17' },
            { time: '19:30 – 21:05', name: 'Введение в инженерное образование', type: 'Лекция', teacher: 'Махахей А.Н.', room: 'а.405 к.6' },
        ],
        'Четверг': [
            { time: '12:00 – 13:35', name: 'Физика', type: 'Лабораторная', teacher: 'Бобученко Д.С., Гарновская И.И.', room: 'лаб.412 к.17' },
            { time: '13:55 – 15:30', name: 'Физика', type: 'Лабораторная', teacher: 'Бобученко Д.С., Гарновская И.И.', room: 'лаб.412 к.17' },
            { time: '15:40 – 17:15', name: 'Физкультура', type: ' ', teacher: 'Кришталь С.А., Панова Е.В.', room: 'к.11Б' },
            { time: '17:45 – 19:20', name: 'Инженерная графика', type: 'Практика', teacher: 'Джежора С.В.', room: 'а.518 к.8' },
            { time: '19:30 – 21:05', name: 'ОИЗ.Математика', type: 'Практика', teacher: 'Доронина А.В.', room: 'а.220 к.6' },
        ],
        'Пятница': [
            { time: '13:55 – 15:30', name: 'Физика', type: 'Практика', teacher: 'Бобученко Д.С.', room: 'а.201 к.17' },
            { time: '15:40 – 17:15', name: 'Математика', type: 'Практика', teacher: 'Доронина А.В.', room: 'а.221 к.6' },
            { time: '17:45 – 19:20', name: 'Технология конструкционных материалов', type: 'Лабораторная', teacher: 'Чигринов В.Е., Пузынин Я.С.', room: 'лаб.12 к.7', subgroup: '1-я подгруппа' },
            { time: '17:45 – 19:20', name: 'Информатика', type: 'Лабораторная', teacher: 'Кавальчук О.Н.', room: 'а.406 к.6', subgroup: '2-я подгруппа' },
            { time: '19:30 – 21:05', name: 'Информатика', type: 'Лабораторная', teacher: 'Кавальчук О.Н.', room: 'а.406 к.6', subgroup: '1-я подгруппа' },
        ],
        'Суббота': [
            { time: '12:00 – 13:35', name: 'Технология конструкционных материалов', type: 'Лекция', teacher: 'Мамонов А.М.', room: 'а.4п к.8' },
            { time: '13:55 – 15:30', name: 'Кураторский час', type: '', teacher: '?', room: '' },
        ]
    }
};
